package ru.klimachkov.workplaces.security.jwt;

/**
 * Типы JWT-токенов, используемых для аутентификации пользователей
 *
 * <p>Определяет назначение токена в процессе авторизации:
 * краткоживущий access-токен для доступа к защищенным ресурсам
 * и refresh-токен для получения нового access-токена.</p>
 *
 * <ul>
 *     <li>{@link #ACCESS} — JWT-токен, используемый
 *     для аутентификации пользователя при обращении к защищенным эндпоинтам</li>
 *     <li>{@link #REFRESH} — JWT-токен, используемый для получения нового access-токена</li>
 * </ul>
 */
public enum JwtTokenType {
    ACCESS,
    REFRESH
}
